code/openfoam/tutorials/incompressibleVoF/mixerVessel/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "mixerVessel-vessel.stl"
    "mixerVessel-oilInlet.stl"
    "mixerVessel-stirrer.stl"
    "mixerVessel-outlet.stl"
    "mixerVessel-shaft.stl"
    "mixerVessel-shaftRotating.stl"
    "mixerVessel-baffles.stl"
    "mixerVessel-sparger.stl"
    "rotating.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle       120;

// ************************************************************************* //
